{
  "races": {
    "Versatile": "Humans gain +1 to all ability scores, making them adaptable to any class.",
    "Extra Language": "You can speak, read, and write one additional language of your choice.",
    "Extra Skill Proficiency": "You gain proficiency in one skill of your choice.",
    "Darkvision": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light.",
    "Keen Senses": "You have proficiency in the Perception skill.",
    "Fey Ancestry": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.",
    "Trance": "Elves don't need to sleep. Instead, they meditate deeply for 4 hours a day.",
    "Elf Weapon Training": "You have proficiency with the longsword, shortsword, shortbow, and longbow.",
    "Dwarven Resilience": "You have advantage on saving throws against poison, and you have resistance against poison damage.",
    "Dwarven Combat Training": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
    "Stonecunning": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient and add double your proficiency bonus.",
    "Lucky": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
    "Brave": "You have advantage on saving throws against being frightened.",
    "Halfling Nimbleness": "You can move through the space of any creature that is of a size larger than yours.",
    "Draconic Ancestry": "You have draconic ancestry. Choose one type of dragon. Your breath weapon and damage resistance are determined by the dragon type.",
    "Breath Weapon": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.",
    "Damage Resistance": "You have resistance to the damage type associated with your draconic ancestry.",
    "Hellish Resistance": "You have resistance to fire damage.",
    "Infernal Legacy": "You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day.",
    "Gnome Cunning": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.",
    "Menacing": "You gain proficiency in the Intimidation skill.",
    "Relentless Endurance": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.",
    "Savage Attacks": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.",
    "Skill Versatility": "You gain proficiency in two skills of your choice."
  },
  "classes": {
    "Fighting Style": "You adopt a particular style of fighting as your specialty. Choose one fighting style option.",
    "Second Wind": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.",
    "Action Surge": "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.",
    "Extra Attack": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "Spellcasting": "You have learned to cast spells through study, devotion, or innate power. You can cast spells using spell slots.",
    "Arcane Recovery": "You have learned to regain some of your magical energy by studying your spellbook. Once per day during a short rest, you can recover spell slots.",
    "Spellbook": "At 1st level, you have a spellbook containing six 1st-level wizard spells of your choice.",
    "Ritual Casting": "You can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook.",
    "Divine Domain": "Choose one domain related to your deity. Your domain grants you domain spells and other features.",
    "Channel Divinity": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using it to fuel magical effects.",
    "Turn Undead": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead within 30 feet must make a Wisdom saving throw or be turned.",
    "Expertise": "At 1st level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
    "Sneak Attack": "Once per turn, you can deal extra damage (1d6, increasing with level) to one creature you hit with an attack if you have advantage or an ally is within 5 feet of the target.",
    "Thieves' Cant": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation.",
    "Cunning Action": "Starting at 2nd level, you can take a bonus action on each of your turns to Dash, Disengage, or Hide.",
    "Favored Enemy": "You have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. You have advantage on Survival checks to track them.",
    "Natural Explorer": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions.",
    "Ranger Archetype": "At 3rd level, you choose an archetype that you strive to emulate, such as Hunter or Beast Master.",
    "Rage": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action, gaining bonus damage, resistance to physical damage, and advantage on Strength checks.",
    "Unarmored Defense": "While not wearing armor, your AC equals 10 + your Dexterity modifier + your Constitution modifier (Barbarian) or Wisdom modifier (Monk).",
    "Bardic Inspiration": "You can inspire others through stirring words or music. A creature that has a Bardic Inspiration die can roll it and add the number to one ability check, attack roll, or saving throw.",
    "Druidic": "You know Druidic, the secret language of druids. You can use it to leave hidden messages that only other druids can understand.",
    "Wild Shape": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before.",
    "Martial Arts": "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons. You can use Dexterity for attack and damage rolls, and roll a d4 for unarmed damage.",
    "Divine Sense": "As an action, you can detect the presence of any celestial, fiend, or undead within 60 feet of you. You know the type but not identity.",
    "Lay on Hands": "You have a pool of healing power equal to your paladin level × 5. As an action, you can touch a creature and restore hit points from this pool.",
    "Sorcerous Origin": "Choose a sorcerous origin that describes the source of your innate magical power, such as Draconic Bloodline or Wild Magic.",
    "Pact Magic": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. Your spell slots recover on a short rest.",
    "Eldritch Invocations": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability."
  }
}